[
  {
    "id": "1001",
    "chef_name": "Chef Tony",
    "picture": "https://files.catbox.moe/afoopw.jpg",
    "bio": "Chef Tony is a renowned culinary expert with over 20 years of experience in the food industry. He has gained widespread recognition for his innovative cooking style, which blends traditional flavors with modern techniques.Born and raised in Italy, Chef Tony's passion for cooking began at a young age, inspired by his grandmother's homemade pasta and his father's love for grilling. He trained at some of the best culinary schools in Italy before moving to the United States to hone his skills and explore new culinary horizons.",
    "years_of_experience": 8,
    "num_recipes": 30,
    "likes": 5000,
    "recipes": [
      {
        "id": "1",
        "title": "Apple Frangipan Tart",
        "ingredients": ["butter", "ground almonds", "sugar", "eggs", "apples"],
        "ratings": "3",
        "description": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
        "image": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
        "tutorial": "https://www.youtube.com/watch?v=rp8Slv4INLk"
      },
      {
        "id": "2",
        "title": "Apple & Blackberry Crumble",
        "ingredients": [
          "apples",
          "blackberries",
          "sugar",
          "butter",
          "all-purpose flour"
        ],
        "ratings": "4",
        "description": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
        "image": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
        "tutorial": "https://www.youtube.com/watch?v=4vhcOwVBDO4"
      },
      {
        "id": "3",
        "title": "Apam balik",
        "ingredients": [
          "flour",
          "sugar",
          "baking powder",
          "eggs",
          "coconut milk"
        ],
        "ratings": "5",
        "description": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
        "image": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
        "tutorial": "https://www.youtube.com/watch?v=6R8ffRRJcrg"
      }
    ]
  },
  {
    "id": 1002,
    "chef_name": "Chef Asad Latif",

    "picture": "https://files.catbox.moe/n10b6m.jpg",
    "bio": "Gourmet expert Asad is a masterful Chef from Pakistan who gives grand cooking formulas on Lazzat with Asad on Metro One. He is the new master specialist that will undoubtedly stay viewers adhere to their TVs, regardless of whether they get joy from cooking or not. For this work on Bangladeshi food he is places in the list of top 10 chefs in Bangladesh, although currently he is working in Pakistan.  Not just he educates the most delightful dishes from Bangladesh. He likewise entertains gatherings of people with prompt answers for cooking tragedies.",
    "years_of_experience": 12,
    "num_recipes": 75,
    "likes": 15000,
    "recipes": [
      {
        "id": "4",
        "title": "Dal fry",
        "ratings": "3.5",
        "ingredients": ["Toor dal", "Water", "Salt", "Turmeric", "Ghee"],
        "description": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan.",
        "image": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg"
      },
      {
        "id": "5",
        "title": "Dundee cake",
        "ratings": "3.5",
        "ingredients": [
          "Almonds",
          "Butter",
          "Muscovado Sugar",
          "Orange",
          "Apricot Jam"
        ],
        "description": "Put the almonds into a small bowl and pour over boiling water to just cover. Leave for 5 mins then drain in a sieve and leave to dry.\r\nPreheat the oven to 180C/160 C fan/Gas Mark 4. Line a deep loose-based 20cm cake tin with baking parchment.\r\nPut the butter in a large bowl and beat well until soft. Add the sugar and beat until light and fluffy. Stir in the orange zest and apricot jam.\r\nSieve together the flour and baking powder. Add the eggs to the creamed butter and sugar, a little at a time, beating well between each addition. If the mixture starts to curdle, stir in a little flour.\r\nAdd the remaining flour and ground almonds and mix well. Mix in the milk and then add the dried fruit and cherries and mix gently together.\r\nSpoon the mixture into the prepared tin and spread level using the back of a spoon. Arrange the whole almonds close together in neat circles on the top of the cake. Bake in the oven for 45 mins.\r\nLower the oven temperature to 160C/140 C fan/Gas Mark 3 and cook for a further 60–80 minutes. Check the cake after 50 minutes by inserting a wooden or metal skewer into the cake. When it’s done it should have just a few crumbs attached. Check every 10 minutes - it’s important not to overcook this cake so the centre will be a little soft.\r\nWhen cooked, remove the cake briefly from the oven, put the milk and sugar into a small pan and heat gently until the sugar has dissolved. Brush over the top of the cake and return the cake to the oven for 2-3 mins. Remove and allow the cake to cool in the tin. When quite cold remove from the tin and wrap in foil and keep for at least 2 days before cutting.",
        "image": "https://www.themealdb.com/images/media/meals/wxyvqq1511723401.jpg"
      },
      {
        "id": "6",
        "title": "Duck Confit",
        "ratings": "4",
        "ingredients": ["Sea Salt", "Bay Leaf", "Garlic", "Thyme", "Duck Legs"],
        "description": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
        "image": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg"
      }
    ]
  },
  {
    "id": 1003,
    "chef_name": "Chef Kabir",
    "picture": "https://files.catbox.moe/1c1ouv.jpg",
    "bio": "Siddiqua Kabir (May 7, 1931 – January 31, 2012) was a Bangladeshi nutritionist, scholastic, cookbook writer andcooking show TV have. A teacher, Kabir facilitated and visitor featured in various network shows featuringBangladeshi food, including Siddiqua Kabir’s Recipe on NTV Bangla . Kabir got honors from the culinary and media businesses, including the Sheltech Award, which was given to her in 2009. Her countless contributions for Bangladesh food, she is ranked at fourth position among top 10 chefs in Bangladesh.",
    "years_of_experience": 5,
    "num_recipes": 20,
    "likes": 2000,
    "recipes": [
      {
        "id": "7",
        "title": "Chocolate Gateau",
        "ratings": "4.5",
        "ingredients": [
          "Plain chocolate",
          "Butter",
          "Milk",
          "Eggs",
          "Granulated Sugar",
          "Flour"
        ],
        "description": "Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r\nBreak the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r\nPlace the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r\nSpread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely.",
        "image": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg"
      },
      {
        "id": "8",
        "title": "Chicken Enchilada Casserole",
        "ratings": "5",
        "ingredients": [
          "Enchilada sauce",
          "shredded Monterey Jack cheese",
          "corn tortillas",
          "chicken breasts"
        ],
        "description": "Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom.\r\nRemove chicken from the pot and shred with two forks.\r\nPreheat oven to 375 F degrees.\r\nStart layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese.\r\nBake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top.\r\nServe warm.",
        "image": "https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg"
      },
      {
        "id": "9",
        "title": "Cream Cheese Tart",
        "ratings": "3",
        "ingredients": ["Flour", "Butter", "Egg", "Salt", "Cheese"],
        "description": "Grease a 1 litre/2 pint pie dish with butter.\r\nCut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.\r\nArrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.\r\nGently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.\r\nCrack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.\r\nAdd the warm milk and cream mixture and stir well, then strain the custard into a bowl.\r\nPour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.\r\nPreheat the oven to 180C/355F/Gas 4.\r\nPlace the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown.",
        "image": "https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg",
        "tutorial": "https://www.youtube.com/watch?v=Vz5W1-BmOE4"
      }
    ]
  },
  {
    "id": 1004,
    "chef_name": "Chef Mr Tonmay Khan",
    "picture": "https://files.catbox.moe/kk8l67.jpg",
    "bio": "Chef Mr Tonmay Khan is a rising culinary star who is quickly making a name for himself in the food industry. With a unique approach to cooking that combines traditional techniques with modern flavors, Chef Tonmay is known for creating dishes that are both innovative and delicious.Born and raised in India, Chef Tonmay's love for cooking began at a young age, inspired by his mother's homemade meals and his family's passion for food. He honed his skills through apprenticeships with some of the best chefs in the country before embarking on his own culinary journey.",
    "years_of_experience": 15,
    "num_recipes": 100,
    "likes": 25000,
    "recipes": [
      {
        "id": "10",
        "title": "Christmas Pudding Flapjack",
        "ratings": "4.5",
        "ingredients": [
          "salted butter",
          "dark soft brown sugar",
          "golden syrup",
          "orange",
          "rolled oats"
        ],
        "description": "Preheat the oven to 180°C/fan 160°C/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r\n\r\nAdd the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r\n\r\nKeeps for 5 days in an air tight tin or freeze for up to 1 month.",
        "image": "https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg"
      },
      {
        "id": "11",
        "title": "Chicken Handi",
        "ratings": "4.5",
        "ingredients": [
          "Chicken",
          "Onion",
          "Tomatoes",
          "Garlic",
          "Ginger paste"
        ],
        "description": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
        "image": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg"
      },
      {
        "id": "12",
        "title": "Chicken Alfredo Primavera",
        "ratings": "5",
        "ingredients": ["Butter", "Olive Oil", "Chicken", "Salt", "Squash"],
        "description": "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. ",
        "image": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg"
      }
    ]
  },
  {
    "id": 1005,
    "chef_name": "Chef Ahmed Hossain",
    "picture": "https://files.catbox.moe/cpv2pg.jpg",
    "bio": "Gourmet expert Ahmed Hossain, a nature significant name is placed at first position among top 10 chefs in Bangladesh. He was conceived in a riverside town of Bangladesh. After his secondary school, concentrated on accommodation administration at National Hotel and Tourism Training Institute, Dhaka. In 2006 Chef Ahmed began consultancy with Dhaka Regency unique task of kitchen organizer following 6 months at last joined as Executive Chef and worked there till 31st July, 2010.",
    "years_of_experience": 7,
    "num_recipes": 50,
    "likes": 8000,
    "recipes": [
      {
        "id": "13",
        "title": "Chicken Fajita Mac and Cheese",
        "ratings": "4",
        "ingredients": [
          "macaroni",
          "chicken stock",
          "heavy cream",
          "fajita seasoning",
          "salt"
        ],

        "description": "Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly.\r\nAdd your cream, stock and macaroni.\r\nCook on low for 20 minutes. Add your cheeses, stir to combine.\r\nTop with roasted peppers and parsley.",
        "image": "https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg"
      },
      {
        "id": "14",
        "title": "Cajun spiced fish tacos",
        "ratings": "5",
        "ingredients": [
          "cajun",
          "cayenne pepper",
          "white fish",
          "vegetable oil",
          "flour tortilla"
        ],

        "description": "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r\n\r\nOn a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r\n\r\nHeat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r\n\r\nMeanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r\nSoften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing.",
        "image": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg"
      },
      {
        "id": "15",
        "title": "Crock Pot Chicken Baked Tacos",
        "ratings": "4",
        "ingredients": [
          "Chicken Breasts",
          "Vinaigrette Dressing",
          "Cumin",
          "Smoked Paprika",
          "Garlic"
        ],
        "description": "Put the uncooked chicken breasts in the crock pot. Pour the full bottle of salad dressing over the chicken. Sprinkle the rest of the ingredients over the top and mix them in a bit with a spoon.\r\nCover your crock pot with the lid and cook on high for 4 hours.\r\nRemove all the chicken breasts from the crock pot and let cool.\r\nShred the chicken breasts and move to a glass bowl.\r\nPour most of the liquid over the shredded chicken.\r\nFOR THE TACOS:\r\nMake the guacamole sauce by mixing the avocado and green salsa together. Pour the guacamole mixture through a strainer until smooth and transfer to a squeeze bottle. Cut the tip off the lid of the squeeze bottle to make the opening more wide if needed.\r\nMake the sour cream sauce by mixing the sour cream and milk together until you get a more liquid sour cream sauce. Transfer to a squeeze bottle.\r\nIn a 9x 13 glass baking dish, fill all 12+ tacos with a layer of refried beans, cooked chicken and shredded cheese.\r\nBake at 450 for 10-15 minutes just until the cheese is melted and bubbling.\r\nOut of the oven top all the tacos with the sliced grape tomaotes, jalapeno and cilantro.\r\nFinish with a drizzle of guacamole and sour cream.\r\nEnjoy!",
        "image": "https://www.themealdb.com/images/media/meals/ypxvwv1505333929.jpg"
      }
    ]
  },
  {
    "id": 1006,
    "chef_name": "Chef Fakruddin",
    "picture": "https://files.catbox.moe/4tbof2.jpg",
    "bio": "Since 1966, Haji Fakruddin had challenged outrageous financial hardships since his move to Bangladesh. He amid a stretch to squeeze out a work, he was acquainted with Muslim Miah, a culinary specialist to the Nawabs of India.From Muslim Miah, Fakruddin figured out how to cook. It was short colleague which uncovered to Fakruddin his shrouded, characteristic style and outrageous enthusiasm for cooking. While working in the Viqarun Nisa, he earned a name for his pleasantness, mild-mannered and tender nature. Now he is among the top 10 chefs in Bangladesh.",
    "years_of_experience": 3,
    "num_recipes": 15,
    "likes": 1000,
    "recipes": [
      {
        "id": "16",
        "title": "Chicken Karaage",
        "ratings": "4.5",
        "ingredients": [
          "Chicken thigh",
          "Ginger",
          "Garlic",
          "Soy sauce",
          "Sake"
        ],
        "description": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges.",
        "image": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg"
      },
      {
        "id": "17",

        "title": "Coq au vin",
        "ratings": "4.5",
        "ingredients": [
          "Olive Oil",
          "Bacon",
          "Shallots",
          "Chicken Legs",
          "Chicken Thighs"
        ],

        "description": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r\nPat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r\nScatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r\nReturn the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r\nJust before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r\nLift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley.",
        "image": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg"
      },
      {
        "id": "18",
        "title": "Chilli prawn linguine",
        "ratings": "3.5",
        "ingredients": [
          "Linguine Pasta",
          "Sugar Snap Peas",
          "Olive Oil",
          "Garlic Clove",
          "Red Chilli"
        ],

        "description": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
        "image": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg"
      }
    ]
  }
]
